A=eye(2,4)%生成（2*4）数值数组
A_str1=int2str(A)%转换成（2*10）串数组
size(A_str1)
% exampleA1_3
% 
% A =
% 
%      1     0     0     0
%      0     1     0     0
% 
% 
% A_str1 =
% 
% 1  0  0  0
% 0  1  0  0
% 
% 
% ans =
% 
%      2    10
% 
rng default
B=rand(2,4)%生成数值矩阵
B3=num2str(B,3)%保持3位有效数字，转换为串
size(B)
size(B3)
% B =
% 
%     0.8147    0.1270    0.6324    0.2785
%     0.9058    0.9134    0.0975    0.5469
% 
% 
% B3 =
% 
% 0.815     0.127     0.632     0.278
% 0.906     0.913    0.0975     0.547
% 
% 
% ans =
% 
%      2     4
% 
% 
% ans =
% 
%      2    35