%通过阅读下面的代码，将会对整个算法有一个整体上的认识
%检测算法的程序代码
clear all
A(:,:,1)= [1, 2, 3; 4, 5, 6];
A(:,:,2)= [7, 8, 9; 10, 11, 12];
A(:,:,3)= [13, 14, 15; 16, 17, 18];
A(:,:,4)= [19, 20, 21; 22, 23, 24];%构造一个2*3*4的张量
A1= reshape(A, 2, 12);%将张量展开成2*12的矩阵
[U, S, V]= svd(A1);%进行第1次svd计算
V1= reshape(V(:,1), 3, 4);%取矩阵V的第1列，折叠成3*4的矩阵
[U1, S1, V1]= svd(V1);%进行第2次svd计算
V2= reshape(V(:,2), 3, 4);%取矩阵V的第2列，折叠成3*4的矩阵
[U2, S2, V2]= svd(V2);%进行第3次svd计算
sigma= [S(1,1)*diag(S1); S(2,2)*diag(S2)]%根据S1和S2的对角元素与S的对角元素对应项相乘
reshape(mkron(V1(:,1),U1(:,1),U(:,1)), 2, 3, 4)*sigma(1)
s1=reshape(mkron(V1(:,1),U1(:,1),U(:,1)), 2, 3, 4)*sigma(1);%使用kronecker积恢复出原来的张量，所以使用reshape折叠成同样的形式
s2=reshape(mkron(V2(:,1),U2(:,1),U(:,2)), 2, 3, 4)*sigma(4)
s1+s2
s3=reshape(mkron(V1(:,2),U1(:,2),U(:,1)), 2, 3, 4)*sigma(2)
s1+s2+s3
s4=reshape(mkron(V2(:,2),U2(:,2),U(:,2)), 2, 3, 4)*sigma(5)
s1+s2+s3+s4